# Константы
NUM_BUSES = 8  # кол-во автобусов
NUM_DRIVERS = 10  # кол-во водителей
BUS_INTERVAL_MIN = 10  # мин. интервал между отправлениями автобусов (в минутах)
WORK_HOURS_VARIANT_1 = 8  # макс. количество рабочих часов для водителей первого варианта
WORK_HOURS_VARIANT_2 = 12  # макс. количество рабочих часов для водителей второго варианта
GENERATION_SIZE = 50  # размер популяции в генетическом алгоритме
MUTATION_RATE = 0.1  # вер-ть мутации
NUM_GENERATIONS = 100  # кол-во поколений
MIN_NUM_DRIVER_VARIANT_1 = 3  # мин. кол-во водителей варианта 1

